tutorials/incompressible/pisoFoam/LES/pitzDailyMapped/0/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type                mapped;
        value               uniform 0;
        interpolationScheme cell;
        setAverage          false;
        average             0;
    }

    outlet
    {
        type                inletOutlet;
        inletValue          uniform 0;
        value               uniform 0;
    }

    upperWall
    {
        type                fixedValue;
        value               uniform 0;
    }

    lowerWall
    {
        type                fixedValue;
        value               uniform 0;
    }

    frontAndBack
    {
        type                empty;
    }
}

// ************************************************************************* //
